Управление_торговлей.ПБТ/src/Documents/КартаРазрешения/КартаРазрешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КартаРазрешения</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <basedOn>Document.КартаРазрешения</basedOn>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПротоколАнализа</types>
      <types>DocumentRef.КартаРазрешения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийЛаб</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКартРазрешения</types>
    </type>
  </attributes>
  <attributes>
    <name>История</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Протокол</name>
    <type>
      <types>DocumentRef.ПротоколАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>EnumRef.РешенияПоКартамРазрешения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияРешения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПротокола</name>
    <comment>Если документ сделан не по протоколу в 1с</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаПретензия</name>
    <comment>0-не выставлена, 1 - претензия, 2 - жалоба</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПретензии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительноеРешение</name>
    <type>
      <types>EnumRef.РешенияПоКартамРазрешения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияПредвРешения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартыРазрешения</name>
    <type>
      <types>EnumRef.ВидыКартРазрешения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаДефектаТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОбразца</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоОтправилОбразец</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОбразца</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПолучилОбразец</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбразец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Претензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образец</name>
    <type>
      <types>CatalogRef.ЛабораторныйОбразец</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <comment>Только для органолептики</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеЗначение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РешенияОПереработке</name>
    <attributes>
      <name>ГП</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/КартаРазрешения/ObjectModule.bsl
Перем СтруктураОбязательныхПолей Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТЗНесоответствий;
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		//Пытаемся найти уже созданные карты на основании этого протокола
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КартаРазрешения.Ссылка
		|ИЗ
		|	Документ.КартаРазрешения КАК КартаРазрешения
		|ГДЕ
		|	КартаРазрешения.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Сообщить("На основании протокола "+ ДанныеЗаполнения+ " уже создан документ "+Выборка.ссылка);
			СтрандартнаяОбработка = ЛОжь;
			Возврат;
		КонецЕсли; 	
		
		ДокументОснование = ДанныеЗаполнения;
		Протокол = ДокументОснование;
		Образец = ДанныеЗаполнения.Образец;
		ДокументПоступления = Образец.ДокументПоступления;
		КодПродукта = Образец.КодПродукта;
		Номенклатура = Образец.Номенклатура;
		Серия = Образец.СерияНоменклатуры;
		НомерЗамеса = Образец.НомерЗамеса;
		Организация = Образец.Организация;
		ВидИсследования = Образец.ВидИсследования;
		ДатаИзготовления = Образец.ДатаИзготовления;
		
		КомментарийЛаб = ДанныеЗаполнения.КомментарийДляПечати; //0013622
		Комментарий = ДанныеЗаполнения.КомментарийДляКартыРазрешения; //0020408
		//Разработки = ДанныеЗаполнения.Разработки;
		
		Если Лаборатория_Сервер.гл_ОбразецСоответствуетНормативам(ДанныеЗаполнения, , ДанныеЗаполнения.ТЧ_Показатели.Выгрузить(), ТЗНесоответствий) Тогда
			Сообщить("Протокол соответсвует нормативам!");
			СтандартнаяОбработка = ЛОжь;
		Иначе
			ТЧ_Показатели.Загрузить(ТЗНесоответствий);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КартаРазрешения") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Протокол = ДокументОснование.Протокол; 
		ДокументПоступления = ДанныеЗаполнения.ДокументПоступления;
		КодПродукта = ДанныеЗаполнения.КодПродукта;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		Серия = ДанныеЗаполнения.Серия;
		Организация = ДанныеЗаполнения.Организация;
		ВидИсследования = ДанныеЗаполнения.ВидИсследования;
		НомерЗамеса = ДанныеЗаполнения.НомерЗамеса;
		ДатаИзготовления = ДанныеЗаполнения.ДатаИзготовления;
		
		ТЧ_Показатели.Загрузить(ДокументОснование.ТЧ_Показатели.Выгрузить());
		
		История = ДанныеЗаполнения.История+Символы.ПС+
		ДанныеЗаполнения + Символы.ПС+ СокрЛП(ДанныеЗаполнения.Комментарий) + Символы.ПС+ДанныеЗаполнения.ПринялРешение+ Символы.ПС+
		СокрЛП(ДанныеЗаполнения.ПринятоРешение)+ Символы.ПС +СокрЛП(ДанныеЗаполнения.КомментарийЛаб);
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ПринялРешение) Тогда
		ПринялРешение = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Сообщить("Документ "+Ссылка);
		Сообщить("Не заполнен статус!");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) //0020623
	
	//Если Не ЗначениеЗаполнено(ПлановаяДатаРеализации) Тогда
	//	ЗаполнитьДатуИзСменного();
	//КонецЕсли; 
	Если Не ЗначениеЗаполнено(Количество) Тогда
		ЗаполнитьКоличествоИзМЛП();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоИзМЛП() Экспорт //0020623
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(МаршрутныйЛистПродукция.Количество) КАК Количество
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛистПродукция
	               |ГДЕ
	               |	МаршрутныйЛистПродукция.Номенклатура = &Номенклатура
	               |	И МаршрутныйЛистПродукция.НомерСменыЗамеса = &НомерЗамеса
	               |	И МаршрутныйЛистПродукция.Дата МЕЖДУ &НачГода И &КонГода
	               |	И МаршрутныйЛистПродукция.Серия = &Серия";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура );
	Запрос.УстановитьПараметр("Серия", Серия );
	Запрос.УстановитьПараметр("НомерЗамеса", НомерЗамеса );
	
	Если ЗначениеЗаполнено(ДатаИзготовления) Тогда 
		Запрос.УстановитьПараметр("НачГода", НачалоГода(ДатаИзготовления));
		Запрос.УстановитьПараметр("КонГода", КонецГода(ДатаИзготовления));
	Иначе	
		Запрос.УстановитьПараметр("НачГода", НачалоГода(Дата));
		Запрос.УстановитьПараметр("КонГода", КонецГода(Дата));
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
	
КонецПроцедуры
